#pragma once
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#include <Arduino.h>
#include "Settings.h"
#include "CONFIG.h"
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
class SDFakeFilesClass
{
  public:

    SDFakeFilesClass();


    // добавляет фейковые файлы в список директории
    void addToLS(const String& requestedDirName, Stream* pStream);

    // проверяет, наш ли это фейковый файл?
    bool isOurFakeFile(const String& fileName);
    
    // возвращает размер фейкового файла
    uint32_t getFileSize(const String& fileName);

    // печатает фейковый файл в поток
    void printFakeFile(const String& fileName, Stream* pStream);
    


  private:


};
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
extern SDFakeFilesClass SDFakeFiles;
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
