#pragma once

#include "TinyVector.h"


//--------------------------------------------------------------------------------------------------------------------------------
// настройки Serial. Настройки для общения через UART
//--------------------------------------------------------------------------------------------------------------------------------
#define DEBUG_SERIAL                  Serial // какой Serial использовать для работы с программой UROVConfig.exe
#define DEBUG_SERIAL_SPEED            115200 // скорость работы с CONFIG_SERIAL
//--------------------------------------------------------------------------------------------------------------------------------
#define _DEBUG // закомментировать для выключения отладочной информации

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#ifdef _DEBUG
#define DBG(s) { Serial.print((s)); }
#define DBGLN(s) { Serial.print((s)); Serial.println(); }
#else
#define DBG(s) (void) 0
#define DBGLN(s) (void) 0
#endif
#define ENDL '\n'
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//template <typename T> inline Stream& operator << (Stream& s, T n) { s.print(n); return s; }
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
